# ==========================================
# AI-Hub 라벨 → 실제 병명 변환 테이블
# ==========================================

DISEASE_MAP = {
    "a7": "감귤_궤양병",
    "a1": "감귤_정상",
    "a2": "감귤_귤응애",
    "a3": "감귤_진딧물",

    "b1": "사과_정상",
    "b2": "사과_탄저병",
    "b3": "사과_갈색무늬병",

    "c1": "고추_정상",
    "c2": "고추_탄저병",
    "c3": "고추_역병",

    "d1": "포도_노균병",
    "d2": "포도_정상",

    "e1": "복숭아_세균성구멍병",
    "e2": "복숭아_정상"
}

CROP_MAP = {
    1: "사과",
    2: "감귤",
    3: "고추",
    4: "포도",
    5: "복숭아",
    6: "자두",
    7: "블루베리"
}

def decode_disease(code: str):
    return DISEASE_MAP.get(code, "unknown")

def decode_crop(code: int):
    return CROP_MAP.get(code, "unknown")